org/jeffreys_prior.org
#+SETUPFILE:./hugo_setup.org
#+HUGO_SLUG: jeffreys_prior
#+TITLE: Jeffreys Prior

The Jeffrey's prior is an easy-to-compute reference prior that is
invariant to transformation, used in [[file:bayesian_inference.org][Bayesian Inference]]. If the model
only has a univariate parameter $\theta$, the prior is given by:

\begin{equation}
  p(\theta) \propto \sqrt{I(\theta)}
\end{equation}

where $I(\theta)$ is the expected [[file:fisher_information.org][Fisher information]] in the model.

If $\mathbf{\theta}$ is multi-dimensional, then the Jeffrey's prior is
given by:

\begin{equation}
  p(\theta) \propto \sqrt{\operatorname{det}\{l(\theta)\}}
\end{equation}

where I is the [[file:fisher_information.org][Fisher information matrix]]. When the number of
dimensions is large, this method becomes cumbersome. A common approach
is to obtain non-informative priors for the parameters individually,
and form the joint prior as a product of these individual priors.
